Makro/Pruebas/Prueba 8.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|01|F|SETT|15|2022-02-10|13:22:00|COP||1|31|900059238|MAKRO|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|1|31|9006981087|ALIANZA DE INVERSIONES MESA MU|ALIANZA DE INVERSIONES MESA MU||||||MONTERIA|TR 5 N 6-16 BODEGA 1|CO|49|34789.92|34789.92|41400.00|0.00|0.00|0.00|41400.00
ENEX|UBL 2.1|10|||||||2022-02-10||13:22:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|CORDOBA|23|Cra.  14  No.  48 A 42 |CO|Colombia|7|31||7|23001|MONTERIA|CORDOBA|23|TR 5 N 6-16 BODEGA 1|CO|Colombia|7|31|2|16FD|01552666|23|Colombia|23001|CORDOBA|Colombia|23|111711|111711
RS|2022-02-17|2028-02-17|SETT|1|1000000||1702202246542
DE|1|353756|PA|1.00|28991.60|28991.60||0.00||false
DEDI|BEB PVO MILO BOL 1100g
DEDI|34500.00
DEDIEX||999|1|||
DEIM|5508.40|28991.60|5508.40|19.00|01|IVA||PA|5508.40
DE|2|102676|CH|1.00|5798.32|5798.32||0.00||false
DEDI|SALSA TOMATE COCINEROS 1.000g
DEDI|6900.00
DEDIEX||999|1|||
DEIM|1101.68|5798.32|1101.68|19.00|01|IVA||CH|1101.68
DIT|6610.00
DI||34790.00|6610.00|19.00|01|6610.00|IVA||
FP|1|10|2022-02-10|2216017569661
PE|Plantilla|T01_MBS.jasper
PE|CodigoBarras|220411081323010380076
PE|PPLTienda|ST16
PE|PPLCaja|1
PE|prom|0
PE|zona|N/A
PE|idInterno|1 2022041108
PE|CentroDistribucion|MAKRO MONTERIA
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|TelCentroDistribucion|N/A
PE|CorreoDist|
PE|PasaporteCliente|16-221318
PE|BarrioCliente|MONTERIA
PE|TelefonoCliente|N/A
PE|vrPuntosCMR|0.00
PE|vrEfectivo|50000.00
PE|vrTdebito|0.00
PE|vrCheque|0.00
PE|vrChequePost|0.00
PE|vrBonos|0.00
PE|vrTcredito|0.00
PE|vrTprivada|0.00
PE|vrNotaCredito|0.00
PE|vrCreditoDirecto|0.00
PE|vrDonacion|0.00
PE|vrCambio|-8600.00
PE|Caja|1 38
PE|TotalArticulos|2
PE|TextoFecha|10-02-2022     13:23     1601 2022041108
PES|CentroDist
PESD|1|MAKRO MONTERIA
PESD|2|Cra.  14  No.  48 A 42 
PES|ResolucionesFactura
PESD|1|AGENTE RETENEDOR IVA RES.00812 30/1/2006
PESD|2|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|3|AUTORETENEDORES DEL IMPUESTO DE RENTA SEGUN RESOL No 1524 DE FEB 20 DE 2006
PES|Regimen
PESD|1|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|2| AUTORETENEDORES DEL IMPUESTO DE RENTA  
PESD|3| SEGUN RESOL No 1524 DE FEB 20 DE 2006  
PESD|4|        AGENTE RETENEDOR DE IVA         
PESD|5|      RESOLUCION 00812 30/01/2006       
PESD|6|
PESD|7|
PESD|8|
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020       CAMBIOS DENTRO DE LOS 7 DIAS HABILES A   PARTIR DE LA COMPRA,PRESENTA LA FACTURA 
PES|Falabella
PESD|1|Gracias por tu visita
PESD|2|
PESD|3|
CTE||||dte_9000592385@dte.paperless.com.co|
CTR|||||
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01</tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope>